01predloga/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    movingWall
    {
        type            patch;
        nFaces          3316;
        startFace       606890;
    }
    front
    {
        type            patch;
        nFaces          208;
        startFace       610206;
    }
    back
    {
        type            patch;
        nFaces          244;
        startFace       610414;
    }
    sphere_1m
    {
        type            wall;
        inGroups        1(wall);
        nFaces          336;
        startFace       610658;
    }
)

// ************************************************************************* //
